import copy

# base_property = {'195': [2125, 2126, 2128, 6873, 2124], '196': [2118, 2120, 2122], '197': [2114, 2115, 8565, 2475, 3304], '492': [2567, 3084], '314': [2014, 3445, 3950], '456': [2452, 2832, 2902], '806': [4066, 4067, 4068, 4484], '592': [3222, 3223], '332': [2067, 2965, 2070, 2069], '580': [3168, 3169], '353': [2129, 2130], '355': [2134, 2135], '1279': [6982, 6985], '325': [2045, 2047], '344': [2102, 2103], '345': [2104, 2105], '347': [2108, 2109], '1268': [6947, 6948]}


# cc = [{'id': 2014, 'name': '大陆国行（有“进网许可”标签）'}, {'id': 2902, 'name': '灰色'}, {'id': 3084, 'name': '全网通'}, {'id': 4066, 'name': '4G+64G'}, {'id': 2026, 'name': '正常进入桌面'}, {'id': 2067, 'name': '无维修情况'}, {'id': 2114, 'name': '很少使用，显示完美几乎全新'}, {'id': 2118, 'name': '很少使用，完美无任何痕迹'}, {'id': 2125, 'name': '很少使用，完美无任何痕迹'}, {'id': 3222, 'name': '账号可退出'}, {'id': 2106, 'name': '充电正常'}, {'id': 6949, 'name': '振动正常'}]

# print('------ccc---------',len(cc))
# print(cc)

def sort3(base_property,cc):
    for c in cc:
        c['k_sort'] = 11111
        for k,v in base_property.items():
            if c['id'] in v:
                c['k_sort'] = int(k)
    print(cc)

    def function(date):
        return date['k_sort']

    cc.sort(key=function)
    return (cc)